Repository: Nellio/wordpress-importer
Catalog: wordpress-importer-*.po
Languages: fr_fr

source: There was an error when reading this WXR file
fr_fr: Une erreur s’est produite à la lecture de ce fichier WXR

source: Details are shown above. The importer will now try again with a different parser...
fr_fr: Les détails sont affichés plus haut. L’importateur va faire une nouvelle tentative avec un autre analyseur.

source: This does not appear to be a WXR file, missing/invalid WXR version number
fr_fr: Ce fichier ne semble pas être un fichier WXR ; le numéro de version WXR est manquant ou non valide.

source: Sorry, there has been an error.
fr_fr: Aïe ! Une erreur s’est produite.

source: The file does not exist, please try again.
fr_fr: Le fichier est introuvable ; veuillez réessayer.

source: All done.
fr_fr: C’est fait.

source: Have fun!
fr_fr: Amusez-vous !

source: Remember to update the passwords and roles of imported users.
fr_fr: Pensez à actualiser les mots de passe et les rôles des utilisateurs importés.

source: This WXR file (version %s) may not be supported by this version of the importer. Please consider updating.
fr_fr: Ce fichier WXR (version %s) n’est peut-être pas pris en charge par cette version de l’importateur. Pensez à faire une mise à jour.

source: Failed to import author %s. Their posts will be attributed to the current user.
fr_fr: Échec de l’importation de l’auteur %s. Ses articles seront assignés à l’utilisateur actuel.

source: Assign Authors
fr_fr: Assigner à un auteur

source: To make it easier for you to edit and save the imported content, you may want to reassign the author of the imported item to an existing user of this site. For example, you may want to import all the entries as <code>admin</code>s entries.
fr_fr: Pour vous faciliter la modification et la sauvegarde du contenu importé, vous pouvez assigner les éléments importés à un utilisateur déjà existant de votre site. Par exemple, vous pouvez attribuer toutes les entrées importées à l’utilisateur <code>admin</code>.

source: If a new user is created by WordPress, a new password will be randomly generated and the new user&#8217;s role will be set as %s. Manually changing the new user&#8217;s details will be necessary.
fr_fr: Si un nouvel utilisateur est créé par WordPress, un nouveau mot de passe sera créé pour lui aléatoirement et le rôle du nouvel utilisateur sera %s. Il sera ensuite nécessaire de modifier et actualiser les informations de profil du nouvel utilisateur.

source: Import Attachments
fr_fr: Importer les médias

source: Download and import file attachments
fr_fr: Télécharger et importer les fichiers associés aux entrées

source: Submit
fr_fr: Procéder à l’importation

source: Import author:
fr_fr: Importer l’auteur :

source: or create new user with login name:
fr_fr: ou créer un nouvel utilisateur avec l’identifiant :

source: as a new user:
fr_fr: en tant que nouvel utilisateur :

source: assign posts to an existing user:
fr_fr: assigner les entrées à un utilisateur existant :

source: or assign posts to an existing user:
fr_fr: ou assigner les entrées à un utilisateur existant :

source: - Select -
fr_fr: - Choisir -

source: Failed to create new user for %s. Their posts will be attributed to the current user.
fr_fr: Échec de la création d’un nouvel utilisateur pour %s. Ses entrées seront assignées à l’utilisateur actuel.

source: Failed to import category %s
fr_fr: Échec de l’importation de la catégorie %s

source: Failed to import post tag %s
fr_fr: Échec de l’importation du mot clé %s

source: Failed to import %s %s
fr_fr: Échec de l’importation de %s %s

source: Failed to import &#8220;%s&#8221;: Invalid post type %s
fr_fr: Échec de l’importation de “%s” : type d’entrée personnalisé invalide

source: %s &#8220;%s&#8221; already exists.
fr_fr: %s “%s” existait déjà.

source: Failed to import %s &#8220;%s&#8221;
fr_fr: Échec de l’importation de %s “%s”

source: Menu item skipped due to missing menu slug
fr_fr: Menu personnalisé ignoré à l’importation en raison de l’absence d’un identifiant de menu

source: Menu item skipped due to invalid menu slug: %s
fr_fr: Menu personnalisé ignoré à l’importation en raison d’un identifiant de menu invalide : %s

source: Fetching attachments is not enabled
fr_fr: L’option d’importation des médias associés n’est pas activée

source: Invalid file type
fr_fr: Type de fichier invalide

source: Remote server did not respond
fr_fr: Le serveur distant ne répond pas

source: Remote server returned error response %1$d %2$s
fr_fr: Le serveur distant a renvoyé le message d’erreur %1$d %2$s

source: Remote file is incorrect size
fr_fr: La taille du fichier à importer est hors des capacités de l’importateur

source: Zero size file downloaded
fr_fr: Le fichier téléchargé est vide

source: Remote file is too large, limit is %s
fr_fr: La taille du fichier à importer est trop importante ; la limite est %s

source: Import WordPress
fr_fr: Importer un site WordPress

source: A new version of this importer is available. Please update to version %s to ensure compatibility with newer export files.
fr_fr: Une nouvelle version de cet importateur est disponible. Veuillez mettre à jour en version %s pour assurer la compatibilité avec les types récents de fichiers d’exportation.

source: Howdy! Upload your WordPress eXtended RSS (WXR) file and we&#8217;ll import the posts, pages, comments, custom fields, categories, and tags into this site.
fr_fr: Salut ! Ça va ? Envoyez votre fichier WordPress eXtended RSS (WXR) et nous nous chargerons d’importer les articles, pages, commentaires, champs personnalisés, catégories et mots-clés dans votre site.

source: Choose a WXR (.xml) file to upload, then click Upload file and import.
fr_fr: Choisissez un fichier WXR (.xml) à envoyer, puis cliquez sur “Envoyer le fichier et l’importer”.

source: Import <strong>posts, pages, comments, custom fields, categories, and tags</strong> from a WordPress export file.
fr_fr: Importer les <strong>articles, pages, commentaires, champs personnalisés, catégories et mots-clés</strong> depuis un fichier d’exportation WordPress.

source: WordPress Importer
fr_fr: Importateur WordPress

source: Import posts, pages, comments, custom fields, categories, tags and more from a WordPress export file.
fr_fr: Importer les articles, pages, commentaires, champs personnalisés, catégories mots-clés, et plus encore, depuis un fichier d’exportation WordPress.
